#### StairsComponentConnectionEndType Enumeration

---

|  |
| --- |
| See Also |

The end type identifying the connection type among stairs runs and landings.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum StairsComponentConnectionEndType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration StairsComponentConnectionEndType ``` |

| Visual C++ |
| --- |
| ``` public enum class StairsComponentConnectionEndType ``` |

# Members

| Member name | Description |
| --- | --- |
| ET\_Landing | A connection to the boundary of a stairs landing. |
| ET\_RunStart | A connection to the start (lower end) of a stairs run. |
| ET\_RunEnd | A connection to the end (upper end) of a stairs run. |

# See Also

Autodesk.Revit.DB.Architecture Namespace